%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% - set_mbd_params -
%%% 機能　①データファイルの読み込み
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% ①データファイルの読み込み

%*********************************車両情報*********************************
%ブレーキ　
BK_PNT_Tau_brake = 0.15; %ブレーキプラントモデル 制動力時定数

%ブレーキ制動力上下限値
BK_PNT_Pow_UL = Brk_UL;  
BK_PNT_Pow_LL = Brk_LL; %ドライバモデルから読み込むので、先にそちらのmファイルを読み出すこと

BK_PNT_ReGene_vel_limit_UP_kmph = 3.0; % 回生ブレーキ打ち切り開始速度[km/h]
BK_PNT_ReGene_vel_limit_DN_kmph = 0.5; % 回生ブレーキ打ち切り終了速度[km/h]