%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% - set_mbd_params -
%%% 機能　①データファイルの読み込み
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% ①データファイルの読み込み

%*********************************高圧バッテリ(Li-ion)*******************************
BT_PNT_Hi_Capa_hi_batt_F = 115;               % 高圧バッテリ容量[Ah]

BT_PNT_Hi_SOC_START_hi_batt =  50;           % 高圧バッテリSOC_初期値[%]
BT_PNT_Hi_SOC_MAX_hi_batt   = 100;          % 高圧バッテリSOC_最大値[%]
BT_PNT_Hi_SOC_MIN_hi_batt   =   0;            % 高圧バッテリSOC_最小値[%]

%高圧バッテリ直列数は96('17LEAF)　1セル3.7Vの時、定格電圧355V
BT_PNT_Hi_ocv_SOC_hi_batt_OCV_V_table_x_SOC =    [   0,   2,   6,  10,  20,  45,  65,  85,  95, 100]; % 高圧バッテリOCV算出MAP x軸SOC項[%]
BT_PNT_Hi_ocv_SOC_hi_batt_OCV_V_table       = 96*[ 3.0, 3.0, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4.1]; % 高圧バッテリOCV算出MAP y軸OCV項[V]

BT_PNT_Hi_R_hi_batt_cell    = 0.001*96*0.1;        % 高圧バッテリ内部セル抵抗[Ω]
%BT_PNT_Hi_R_hi_batt_cell2   = 0.005;        % 高圧バッテリ内部セル抵抗[Ω]
BT_PNT_Hi_R_hi_batt_others  = 0;            % 高圧バッテリ内部セル以外の抵抗[Ω]

BT_PNT_Hi_R_pol_hi_batt     = 0.001*96;       % 高圧バッテリ分極特性抵抗値[Ω]
BT_PNT_Hi_C_pol_hi_batt     = 30;           % 高圧バッテリ分極特性コンデンサ値[F]