%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% - set_mbd_params -
%%% 機能　①データファイルの読み込み
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% ①データファイルの読み込み


BTTH_CNT_P_BT_Heater_W                  = [900,900,  0, 0]; %バッテリヒータ―の目標出力[W]
BTTH_CNT_P_BT_Heater_W_x_BTCells_degC   = [-50,-30,-20, 0]; %このテーブルのx軸　バッテリセル温度[℃]

BTTH_CNT_Voltage_BTFan_V                = [0, 0,12,12];
BTTH_CNT_Voltage_BTFan_V_x_BTCells_degC = [0,30,45,60]; %
