%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% - set_mbd_params -
%%% 機能　①データファイルの読み込み
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% ①データファイルの読み込み

%*********************************降圧コンバータ*********************************
DCDC_PNT_eta_conv_lo = 0.95;                  % 降圧コンバータ効率[-]
DCDC_PNT_R_conv_lo   = 0.02;                  % 降圧コンバータ抵抗[Ω] ※鉛バッテリ内部抵抗より小さくすると低圧系が発振します
DCDC_PNT_Vtgt_conv_lo = 14.0;                 % 目標降圧コンバーター電圧値[V]