%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% - set_mbd_params -
%%% 機能　①データファイルの読み込み
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% ①データファイルの読み込み

%ウォーターポンプ制御
ELTH_CNT_V_Water_Pump_V               = [ 3, 3, 6, 8,10, 12]; %ウォーターポンプ電圧[V]
ELTH_CNT_V_Water_Pump_x_T_Coolant     = [20,60,70,80,90,100]; %このテーブルのx軸　冷却水温度[℃]

%ラジエターファン制御
ELTH_CNT_V_RDFan_V                     = [ 0, 0, 6, 6,12, 12]; %ラジエターファン電圧[V]
ELTH_CNT_V_RDFan_x_T_Coolant           = [20,80,81,94,95,120]; %このテーブルのx軸　冷却水温度[℃]