%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% - set_mbd_params -
%%% 機能　①データファイルの読み込み
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% ①データファイルの読み込み


%*******************************高圧バッテリ用温度調節システム**************************
BT_PNT_Hi_temp_threshold_heater_ON = -10; %高圧バッテリ―昇温用ヒーターON基準温度[℃]
BT_PNT_Hi_temp_threshold_heater_hys=   5; %高圧バッテリ―昇温用ヒーターONOFFヒス温度[℃]

BT_PNT_Hi_temp_threshold_cooler_ON =  45; %高圧バッテリ―昇温用ヒーターON基準温度[℃]
BT_PNT_Hi_temp_threshold_cooler_hys=  25; %高圧バッテリ―昇温用ヒーターONOFFヒス温度[℃]

BT_PNT_Hi_Power_heater_W = 500;   %高圧バッテリ―昇温用ヒーター目標出力[W]
BT_PNT_Hi_Rw_cooler_ON  = 0.05;   %高圧バッテリ―冷却ON時の熱抵抗[K/W]
BT_PNT_Hi_Rw_cooler_OFF =   50;   %高圧バッテリ―冷却OFF時の熱抵抗[K/W]

C_heat_Hi_Batt = 1000; %高圧バッテリ熱容量[J/K]
T0_Hi_Batt     =    45; %高圧バッテリ初期温度[℃]


%ウォーターポンプ制御
ENG_CNT_V_Water_Pump_V               = [ 3, 3, 6, 8,10, 12]; %ウォーターポンプ電圧[V]
ENG_CNT_V_Water_Pump_x_T_Coolant     = [20,60,70,80,90,100]; %このテーブルのx軸　エンジン冷却水温度[℃]

%ラジエターファン制御
ENG_CNT_V_RDFan_V                     = [ 0, 0, 6, 6,12, 12]; %ラジエターファン電圧[V]
ENG_CNT_V_RDFan_x_T_Coolant           = [20,80,81,94,95,120]; %このテーブルのx軸　エンジン冷却水温度[℃]


